import {Text} from "react-native";

export const privacyPolicyData = [
    {
      listData: [
          {
              key: 'item1',
              text: '使用纪录:当您透过我们的服务发送或接收讯\n' +
                  '息,我们会收集这些讯息资讯,包括时间、日\n' +
                  '期、发件人和收件人等资讯。我们还会收集您发\n' +
                  '送与接收的讯息数量,以及您较常传送讯息的朋\n' +
                  '友名单。我们也会收集您使用我们的服务时的资\n' +
                  '讯,包含您的浏览器类型、语言、使用时间、IP\n' +
                  '位址等。',
          },
          {
              key: 'item2',
              text: '装置资讯:我们会收集您使用我们的服务时使用\n' +
                  '的装置资讯,包括装置类型、操作系统和版本、\n' +
                  '设备标识码、电话号码和行动网络资讯。此外,\n' +
                  '本服务在经过您的同意之下,可取用您装置中的\n' +
                  '电话簿和影像存储应用程式,以方便支援您在使\n' +
                  '用本服务时的功能。位置资讯:在经过您的同意\n' +
                  '之下,我们会收集有关您的装置位置资讯,以方\n' +
                  '便支援您在使用本服务时的功能。',
          },
          {
              key: 'item3',
              text: '数据追踪:我们会使用各种数据追踪技术来收集\n' +
                  '资讯,来帮助我们来改进我们的服务和您的使用\n' +
                  '体验',
          },
      ],
        listData2: [
            {
              key: 'item1',
              text:'其他使用者',
            },
            {
                key: 'item2',
                text:'其他使用者可能在使用我们的服务时提供有关您\n' +
                    '的资讯。例如,如果其他使用者就您的事情与我\n' +
                    '们联系,我们可能会从他们那里收集有关您的资\n' +
                    '讯。',
            },
            {
                key: 'item3',
                text:'社群媒体',
            },
            {
                key: 'item4',
                text:'您可能会使用自己的社群媒体登入资讯(例如\n' +
                    'Facebook 或 twitter 登入资讯)来建立和登入您\n' +
                    '的 糖心 帐号。因此您无须再记住另一组使用者名\n' +
                    '称和密码,并可透过您的社群媒体帐号与我们分\n' +
                    '享一些资讯。',
            },
            {
                key: 'item5',
                text:'其他合作伙伴',
            },
            {
                key: 'item6',
                text:'我们可能会从合作伙伴那里取得有关您的资讯,\n' +
                    '例如,糖心 广告刊登在合作伙伴的网站和平台上\n' +
                    '(这种情况下,他们可能会将活动成功的详细资。\n' +
                    '讯传递给我们) 。',
            },
        ],
        listData3: [
            {
              key: 'item1',
                text: '建立和管理您的帐号',
            },
            {
                key: 'item2',
                text: '为您提供客户支援,和回应您的要求',
            },
            {
                key: 'item3',
                text: '完成您的交易',
            },
            {
                key: 'item4',
                text: '就我们的服务(包括订单管理和计费)与您沟通',
            },
        ],
        listData4: [
            {
              key: 'item1',
              text: '将您使用的各种装置连结起来,以便让您在所有\n' +
                  '装置上享受我们的服务,并获得一致性体验。我\n' +
                  '们透过连结装置和浏览器资料来提供一致性体验\n' +
                  '(例如当您在不同装置上登入帐号时),或使用\n' +
                  '部分或完整的IP 位址、浏览器版本和有关您装置\n' +
                  '的类似资料,来辨识和连结装置。',
            },
        ],
        listData5: [
            {
              key: 'item1',
              text: '让您注册新的 糖心 功能和 app,并显示您的个人\n' +
                  '资料',
            },
            {
                key: 'item2',
                text: '在这些新功能和 app 中管理您的帐号',
            },
        ],
        listData6: [
            {
              key: 'item1',
              text: '管理焦点团体和问卷调查',
            },
            {
                key: 'item2',
                text: '针对使用者行为进行研究和分析,以改善我们的\n' +
                    '服务和内容(例如,我们可能会决定变更外观和\n' +
                    '感觉,或什至根据使用者行为,大幅修改特定功\n' +
                    '能)',
            },
            {
                key: 'item3',
                text: '开发新功能和服务(例如,我们可能会决定根据\n' +
                    '使用者的要求,进一步建立一个以兴趣为依据的\n' +
                    '新功能)',
            },
        ],
        listData7: [
            {
             key: 'item1',
             text: '处理正在发生,或被指控的不当行为(无论是否\n' +
                 '发生在平台上)',
            },
            {
                key: 'item2',
                text: '分析资料,以更加了解这类活动并制定对策',
            },
            {
                key: 'item3',
                text: '保留诈欺活动相关资料,以防止这类活动再次发\n' +
                    '生',
            },
        ],
        listData8: [
            {
              key: 'item1',
              text: '遵守法律要求',
            },
            {
                key: 'item2',
                text: '协助执法',
            },
            {
                key: 'item3',
                text: '执行或行使我们的权利,例如根据条款规定的权\n' +
                    '利',
            },
        ],
        emailLink: [
            {
                key: 'item1',
                text: <Text style={{color: 'blue', textDecorationLine: 'underline'}}>linnannan101@gmail.com</Text>
            }
        ]
    }
]
